// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "Dear 思敬：",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "祝贺你又长大一岁啦",  // 同上...
        "今天是个很特别的日子",
        "让我们一起举杯酒",
        "为我们的友谊干杯",
        "为我们的人生干杯",
        "为我们的梦想干杯",
        "人生有起有落",
        "祝愿你永远如猛虎般",
        "无惧艰难",
        "将黑暗撕碎",
        "走出自己的人生",
        "也希望我能如天边的晚霞",
        "常伴你左右",
        "我很珍惜我们的友谊",
        "虽然平时不怎么讲话",
        "但你一直在我心里",
        "What's past is prologue",
        "愿君去往之地皆为热土",
        "愿君所遇之人皆为挚友",
        "愿你终是你自己 想要的模样",
        "所求皆如愿 所行化坦途",
        "多喜乐 长安宁",
        "生日快乐:-)",
      
        
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"心爱的小可爱": "./imgs/xiaokeai.png",
         "一个小彩蛋 :-P": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "有点暗，开个灯吧",
        play: "好像有什么声音",
        bannar_coming: "好像缺点什么...",
        balloons_flying: "地上有个盒子，里面是什么呢",
        cake_fadein: "是气球！桌子上有什么呢",
        light_candle: "生日蛋糕！来许个愿吧",
        wish_message: "祝我们的思敬又长大一岁啦",
        story: "桌子上还有一份信",
    }
};
